Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/edc/ATSAML22G16A.PIC
      <edc:SFRDef edc:_addr="0x4100804E" edc:access="-----nnn" edc:cname="CHINTFLAG" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:desc="Channel Transfer Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:desc="Channel Transfer Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Channel Suspend" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100804F" edc:access="-----rrr" edc:cname="CHSTATUS" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PEND" edc:desc="Channel Pending" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="Channel Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="Channel Fetch Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41008050" edc:offset="0x1FB0"/>
      <edc:SFRDef edc:_addr="0x4100A000" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="POSITION" edc:impl="0xFFFFFFFC" edc:nzwidth="0x20" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRAP" edc:desc="Pointer Value Wraps" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POINTER" edc:desc="Trace Packet Location Pointer" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A004" edc:access="n---------------------nnnnnnnnnn" edc:cname="MASTER" edc:impl="0x800003FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Maximum Value of the Trace Buffer in SRAM" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TSTARTEN" edc:desc="Trace Start Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSTOPEN" edc:desc="Trace Stop Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFRWPRIV" edc:desc="Special Function Register Write Privilege" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMPRIV" edc:desc="SRAM Privilege" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HALTREQ" edc:desc="Halt Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Main Trace Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:cname="FLOW" edc:impl="0xFFFFFFFB" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="AUTOSTOP" edc:desc="Auto Stop Tracing" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOHALT" edc:desc="Auto Halt Request" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WATERMARK" edc:desc="Watermark value" edc:nzwidth="0x1D"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A00C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="BASE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x4100A010" edc:offset="0xEF0"/>
      <edc:SFRDef edc:_addr="0x4100AF00" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ITCTRL" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x4100AF04" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0x4100AFA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMSET" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMCLR" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x4100AFA8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100AFB0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKACCESS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFB4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFB8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVARCH" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x4100AFC0" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100AFC8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVTYPE" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID4" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID0" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID1" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID2" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:SFRDef edc:_addr="0x4100AFFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CID3" edc:nzwidth="0x20" ltx:memberofperipheral="MTB"/>
      <edc:AdjustPoint edc:_addr="0x4100B000" edc:offset="0xFF5000"/>
      <edc:SFRDef edc:_addr="0x42000000" edc:access="-------n" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
