Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/edc/ATSAML22G16A.PIC
      <edc:SFRDef edc:_addr="0x42003C10" edc:access="--rrrrrr" edc:cname="STATUS" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="VLCDR" edc:desc="VLCD Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRUN" edc:desc="LCD Charge Pump is Running" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VLCDS" edc:desc="VLCD Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMWRBUSY" edc:desc="Character mapping write busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACMBUSY" edc:desc="ACM state machine busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABMBUSY" edc:desc="ABM state machine busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C11" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x42003C14" edc:access="-----------------------------rrr" edc:cname="SYNCBUSY" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLD" edc:desc="Control D" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C18" edc:access="n--nnnnn" edc:cname="FC0" edc:impl="0x9F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Frame Counter Overflow Value" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PB" edc:desc="Prescaler Bypass" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C19" edc:access="n--nnnnn" edc:cname="FC1" edc:impl="0x9F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Frame Counter Overflow Value" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PB" edc:desc="Prescaler Bypass" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C1A" edc:access="n--nnnnn" edc:cname="FC2" edc:impl="0x9F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Frame Counter Overflow Value" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PB" edc:desc="Prescaler Bypass" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C1B" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42003C1C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LPENL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="LPEN" edc:desc="LCD Pin Enable" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C20" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="LPENH" edc:impl="0xFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="LPEN" edc:desc="LCD Pin Enable" edc:nzwidth="0x14"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C24" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C28" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SDATAH0" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C2C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C30" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SDATAH1" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C34" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SDATAL2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C38" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SDATAH2" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLCD">
            <edc:SFRFieldDef edc:cname="SDATA" edc:desc="Segments Data" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
